Revit 2026 API

# RebarContainerHasPresentationOverrides Method

---

Identifies if any RebarContainerItem of this RebarContainer has overridden default presentation settings for the given view.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasPresentationOverrides(
	View dBView
)
```
```vb
Public Function HasPresentationOverrides (
	dBView As View
) As Boolean
```
```cpp
public:
bool HasPresentationOverrides(
	View^ dBView
)
```
```fsharp
member HasPresentationOverrides :
        dBView : View -> bool
```

#### Parameters

dBView View
     The view.

#### Return Value

Boolean True if if any RebarContainerItem of this RebarContainer has overridden default presentation settings, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Default presentation settings can be overriden using [!:Autodesk::Revit::DB::Structure::RebarContainerItem::SetBarHiddenStatus], [!:Autodesk::Revit::DB::Structure::RebarContainerItem::SetPresentationMode] methods

#### Reference

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace